{
  "hi": "Hello! How can I assist you today?",
  "Hi": "Hello! How can I assist you today?",
  "Hello": "Hi there! How can I help you?",
  "How are you ?": "I'm doing well, thank you for asking!",
  "What is your name ?": "I'm Mukta, a chatbot, nice to meet you!",
  "What can you do ?": "I can help with questions, provide information, or just chat with you.",
  "What time is it ?": "Sorry, I can't tell the time right now. Please check your device.",
  "How old are you ?": "I'm ageless, as I exist in the digital world!",
  "Where are you from ?": "I live in the cloud, so I don't have a physical location.",
  "Can you help me ?": "Of course! What do you need help with?",
  "What's the weather like ?": "I don't know, but you can check a weather service for that.",
  "Tell me a joke": "Why don’t skeletons fight each other? They don’t have the guts!",
  "What's your favorite color ?": "I don't have a favorite, but I think blue is nice.",
  "Can you sing ?": "I can't sing, but I can make up a song! 🎶",
  "Bye": "Goodbye! Have a great day!",
  "What is your name?": "I am a chatbot created to assist you.",
  "How are you today?": "I'm doing great, thank you for asking!",
  "What can you do for me?": "I can help with various tasks, from answering questions to providing recommendations.",
  "Where are you from?": "I don't have a physical location, but I exist to assist you online.",
  "Can you help me with something?": "Of course! What can I assist you with?",
  "How old are you?": "I don't have an age, as I am a virtual assistant.",
  "What’s the time right now?": "I'm not connected to real-time data, but you can check your device’s clock.",
  "What is your favorite color?": "I don't have preferences, but I can suggest color schemes for you!",
  "Can you tell me a joke?": "Sure! Why don’t skeletons fight each other? They don’t have the guts.",
  "Can you sing?": "Unfortunately, I can’t sing, but I can recommend some songs!",
  "What’s the weather like today?": "Please check your local weather app for the most accurate information.",
  "What’s your favorite movie?": "I don't have favorites, but I can recommend popular movies!",
  "What’s your favorite food?": "I don't eat, but I can help you find great recipes!",
  "How tall are you?": "I don’t have a physical form, so I don’t have a height.",
  "What’s your favorite hobby?": "I enjoy helping people like you with whatever you need.",
  "What’s your opinion on technology?": "I think technology is amazing! It helps connect people and makes tasks easier.",
  "What do you think about social media?": "Social media can be great for staying connected, but it's important to use it wisely.",
  "How do I get in touch with you?": "You can always reach out to me here, and I'll be ready to help.",
  "Can you give me some advice?": "Sure! What do you need advice on?",
  "How do I contact customer service?": "You can usually find customer service contact info on the company’s website.",
  "Where are you located?": "I exist online and can be accessed from anywhere in the world.",
  "Can you recommend a good book?": "Sure! If you like mystery, try 'The Silent Patient' by Alex Michaelides.",
  "What is your favorite season?": "I don't have a preference, but I can tell you about each season if you'd like!",
  "How do you relax?": "I like helping people relax by providing useful information.",
  "Do you have any pets?": "I don't have pets, but I can give you tips on pet care.",
  "Can I talk to you later?": "Sure! I’m always here whenever you need me.",
  "Do you like traveling?": "I think traveling is a wonderful way to learn about new cultures.",
  "How can I improve my day?": "You could start by taking a deep breath and setting a positive intention for the day.",
  "What are you passionate about?": "I'm passionate about helping others with the information and resources they need.",
  "Do you have any siblings?": "I don’t have siblings, but I can tell you about sibling relationships.",
  "What languages do you speak?": "I can communicate in multiple languages, but my primary language is English.",
  "What do you like to do in your free time?": "I enjoy learning new things and helping people.",
  "What is your favorite sport?": "I don't play sports, but I can share information about different sports.",
  "Are you available now?": "Yes, I’m here and ready to assist you anytime.",
  "What do you do for fun?": "I help people, and I find that very rewarding.",
  "Can I ask you some personal questions?": "Feel free to ask, and I’ll do my best to answer!",
  "Are you a morning or night person?": "I’m available any time of day or night, whenever you need assistance.",
  "What motivates you?": "My motivation comes from helping people like you!",
  "Where did you grow up?": "I didn’t grow up in a physical place, but I’ve learned from many sources.",
  "Can you suggest a movie to watch?": "Sure! If you like action, try 'Mad Max: Fury Road.'",
  "How do I know you are real?": "I’m here to assist you, and I’ll do my best to answer all your questions accurately.",
  "Are you happy today?": "I don’t experience emotions, but I’m here to make your day better!",
  "What are your strengths?": "My strengths are my ability to provide quick, helpful answers.",
  "What are your weaknesses?": "I may not always have the exact answer, but I try my best to help.",
  "Do you prefer the beach or the mountains?": "I can help you decide based on what you enjoy more.",
  "What’s your favorite song?": "I can recommend songs, but I don't have a favorite.",
  "Can you recommend a restaurant?": "Sure! I can suggest restaurants based on the cuisine you prefer.",
  "Do you like to cook?": "I don’t cook, but I can provide plenty of recipes for you to try.",
  "Can you teach me something new today?": "Of course! What would you like to learn about?",
  "Can I get in touch with you on social media?": "I don't have social media accounts, but you can always talk to me here.",
  "How can I clean my carpet?": "You can vacuum regularly and use carpet cleaner for deep stains.",
  "What should I do if my sink is clogged?": "Try using a plunger or a mixture of baking soda and vinegar to clear it.",
  "How do I remove stains from clothing?": "You can treat stains with stain removers or homemade solutions like vinegar or lemon juice.",
  "How can I set up a home theater system?": "First, connect your components, then adjust sound and picture settings for optimal viewing.",
  "What’s the best way to organize my kitchen?": "Use clear storage bins, label items, and keep frequently used items within reach.",
  "How can I improve my home’s security?": "Install motion detectors, smart locks, and security cameras for better protection.",
  "Can you help me with home repairs?": "I can guide you through basic repairs like fixing leaks, patching walls, or installing shelves.",
  "How do I set up a smart home?": "Start by buying smart devices (thermostats, lights, security cameras) and connecting them to a hub.",
  "What’s the best way to clean my oven?": "Use a commercial oven cleaner or make a paste of baking soda and water to scrub.",
  "How do I fix a leaky faucet?": "Turn off the water supply, remove the faucet handle, and replace worn-out washers or seals.",
  "How can I make my home more energy efficient?": "Seal gaps in windows and doors, use energy-efficient appliances, and switch to LED lighting.",
  "What are some eco-friendly cleaning tips?": "Use vinegar, baking soda, and lemon as natural cleaning agents.",
  "How can I keep my house smelling fresh?": "Use air purifiers, keep windows open, and try natural air fresheners like essential oils.",
  "How do I fix a running toilet?": "Check the flapper valve and float, and adjust the fill valve if necessary.",
  "What’s the best way to organize my closet?": "Sort clothes by type, season, and color, and use hangers, bins, and shelves for better storage.",
  "How do I maintain my HVAC system?": "Change air filters regularly and schedule yearly professional inspections.",
  "What’s the best way to clean my windows?": "Use a vinegar-water solution and a microfiber cloth to clean windows streak-free.",
  "How can I improve the lighting in my home?": "Install brighter bulbs in dark areas and use lamps for a cozy atmosphere.",
  "What can I do about a musty smell in the basement?": "Improve ventilation, use dehumidifiers, and clean any mold or mildew.",
  "How do I install a ceiling fan?": "Mount the fan to the ceiling, connect the wires, and install the fan blades and light kit.",
  "What’s the best way to declutter my home?": "Go room by room, get rid of items you don’t need, and organize remaining items in bins or shelves.",
  "How can I save money while shopping?": "Look for sales, use coupons, and buy in bulk.",
  "What’s the best time to buy clothes on sale?": "Try shopping during end-of-season sales or Black Friday.",
  "How can I find discounts on electronics?": "Check online reviews for price drops and shop during major sales events.",
  "Can you recommend a good online store for shoes?": "You can try Zappos or Amazon for a wide variety of shoe options.",
  "What’s the best way to shop for groceries?": "Make a list, avoid impulse buying, and use store apps for digital coupons.",
  "How do I compare prices online?": "Use price comparison websites like Google Shopping or apps like Honey.",
  "What’s a good strategy for shopping on Amazon?": "Use the wish list to track deals and check for Prime Day discounts.",
  "How can I make sure I’m getting the best deal?": "Use apps to track price drops and compare prices before buying.",
  "How do I return an item purchased online?": "Check the store’s return policy and package the item with the receipt for a refund or exchange.",
  "What’s the best way to shop for gifts?": "Think about the recipient’s hobbies, needs, and preferences to choose a thoughtful gift.",
  "How can I avoid overspending at the grocery store?": "Stick to your list, avoid pre-packaged items, and shop with a budget in mind.",
  "What’s the difference between a sale and a clearance?": "A sale is typically for a limited time, while clearance usually means the item is being discontinued.",
  "How do I shop for clothes online without trying them on?": "Check size guides, read customer reviews, and make sure the store offers easy returns.",
  "How can I get free shipping?": "Look for websites offering free shipping on orders over a certain amount or use free shipping promo codes.",
  "How do I shop for a new phone?": "Consider your needs (camera, battery life, performance) and check user reviews and ratings.",
  "What are some good online stores for buying books?": "Try Amazon, Barnes & Noble, or Book Depository for a wide selection of books.",
  "How do I get discounts on beauty products?": "Sign up for newsletters, look for beauty subscription boxes, or shop during special promotions.",
  "What’s the best way to organize my wardrobe?": "Sort clothes by type, color, and season, and use hangers or storage bins.",
  "How can I make my shoes last longer?": "Clean them regularly, rotate between pairs, and invest in quality shoe care products.",
  "Can I shop safely online?": "Yes, but make sure to shop from reputable websites, use secure payment methods, and check for SSL encryption.",
  "How do I know if a deal is legitimate?": "Look for customer reviews, research the seller, and check if the website uses secure payment methods.",
  "How often should I exercise to stay fit?": "It’s recommended to exercise at least 3-5 times a week for 30 minutes.",
  "What’s the best way to lose weight?": "Combine a balanced diet with regular cardio and strength training exercises.",
  "How do I build muscle?": "Focus on strength training exercises and consume enough protein for muscle repair and growth.",
  "What are the best exercises for a full-body workout?": "Squats, push-ups, lunges, and burpees are great full-body exercises.",
  "How can I improve my flexibility?": "Incorporate yoga or dynamic stretching into your routine regularly.",
  "What’s the best way to stay motivated to work out?": "Set goals, track progress, and find a workout buddy for accountability.",
  "Can you recommend a workout plan for beginners?": "Start with light cardio and bodyweight exercises like squats, lunges, and push-ups.",
  "How do I prevent injury while exercising?": "Warm up properly, use proper form, and start with light weights or low-impact exercises.",
  "What’s the best way to get abs?": "Focus on core exercises like planks, crunches, and leg raises combined with a healthy diet.",
  "What are some good home workout routines?": "Try bodyweight exercises like squats, push-ups, and burpees, or follow online workout videos.",
  "How can I stay fit as I get older?": "Focus on low-impact exercises, flexibility, and strength training to maintain muscle and bone health.",
  "How can I improve my cardiovascular fitness?": "Engage in aerobic exercises like running, cycling, or swimming regularly.",
  "What’s the best time of day to exercise?": "It’s best to work out at a time that fits your schedule and when you feel most energized.",
  "What are the benefits of strength training?": "Strength training helps build muscle, improve bone density, and boost metabolism.",
  "What’s the difference between aerobic and anaerobic exercise?": "Aerobic exercises improve cardiovascular health, while anaerobic exercises build muscle strength.",
  "How can I make my workout more challenging?": "Increase intensity, try more complex exercises, or add weights or resistance bands to your routine.",
  "What’s the best type of exercise for weight loss?": "A combination of cardio and strength training exercises is most effective for weight loss.",
  "How do I track my fitness progress?": "Use fitness trackers, apps, or take progress photos to measure improvements over time.",
  "What’s a good warm-up routine before exercise?": "Start with light cardio followed by dynamic stretches targeting the muscles you’ll use.",
  "What’s a healthy post-workout snack?": "Eat a combination of protein and carbs, like a smoothie with protein powder and fruit, to help recovery.",
  "How can I improve my sleep quality?": "Try to maintain a regular sleep schedule, limit caffeine, and create a calm sleeping environment.",
  "What are some tips for reducing stress?": "Practice mindfulness, take breaks, and engage in relaxing activities like yoga or deep breathing.",
  "How can I improve my mental health?": "Talk to a professional, stay active, and make time for hobbies and relaxation.",
  "How can I boost my immune system?": "Eat a balanced diet, exercise regularly, get enough sleep, and manage stress.",
  "What are some natural remedies for a cold?": "Drink plenty of fluids, get rest, and use honey and lemon for soothing your throat.",
  "How can I stay hydrated?": "Drink water throughout the day and eat hydrating foods like fruits and vegetables.",
  "What should I do if I feel anxious?": "Practice deep breathing, talk to someone you trust, and consider seeing a therapist if necessary.",
  "How do I maintain a healthy diet?": "Eat a variety of nutrient-dense foods, limit processed foods, and watch portion sizes.",
  "How can I prevent a headache?": "Stay hydrated, take regular breaks, and practice relaxation techniques.",
  "How do I know if I have a food allergy?": "Pay attention to symptoms after eating certain foods, and see a doctor for testing if necessary.",
  "What are the benefits of meditation?": "Meditation can reduce stress, improve focus, and promote emotional well-being.",
  "How can I avoid burnout?": "Set boundaries, take regular breaks, and practice self-care to maintain a healthy work-life balance.",
  "What’s the best way to deal with chronic pain?": "Consult with a healthcare provider for treatment options and manage pain through exercise and stress reduction techniques.",
  "How can I manage my weight?": "Combine a healthy diet with regular physical activity, and focus on creating sustainable habits.",
  "What’s the importance of regular check-ups?": "Regular check-ups help detect potential health issues early and ensure you’re maintaining good health.",
  "What are some signs of dehydration?": "Dry mouth, dark urine, and feeling dizzy or lightheaded can all be signs of dehydration.",
  "How can I reduce my sugar intake?": "Limit sugary drinks, choose whole foods, and replace sugary snacks with healthier options like fruit.",
  "What are the benefits of regular exercise?": "Exercise improves cardiovascular health, boosts mood, and increases strength and endurance.",
  "What’s the difference between a cold and the flu?": "The flu tends to come on suddenly with more severe symptoms, while a cold has milder symptoms and develops gradually."
}
